    markdown基础
    
0 说明
    作者：woniuray
    创建时间：2016-10-17
    更新时间：2016-10-17
    QQ群交流分享：309683253
    
1 基础语法

    1.1 标题
            把需要作为标题的前加#空格 一共有六级标题
            # 一级标题
            ## 二级标题
            ### 三级标题
            #### 四级标题
            ##### 五级标题
            ###### 六级标题
            
    1.2 列表
            无序列表
                在文字前加-或*或+即可
                例如：
                    - 你好
                    - markdown基础
                    * 你好
                    * markdown基础
            有序列表
                在文字前加1. 2. 3. 符号和文字要有一个空格的字符
                例如：
                    1. 你好
                    2. markdown基础
                    
    1.3 引用
            在文本前加>大于号
            > 这是在引用
            
    1.4 图片与链接
            插入链接与插入图片的语法很像，区别在一个 !号
            #插入链接
            [链接名](http://链接地址)
            #插入图片
            ！[图片名](http://图片地址)
            
    1.5 粗体与斜体
            粗体被两个*或_包围起来
                例如：**粗体**或者__粗体__
            斜体被一个*或_包围起来
                例如：*斜体*或者_斜体_
                
    1.6 代码框
            反引号(`)包围的就是代码
                例如：`代码`
                
    1.7 表格
        | 姓名  |  性别  | 年龄 |
        | ----- |:------ |-----:|
        |张三   |  男    |  19  |
        |李四   |  男    |  20  |
    1.8 分割线
            一行只有一种三个以上的*或者-或者_可以作为分割线
            符号中间可以加一个空格
            例如：***
                * * *
                - - -
    
    1.9 反斜杠
        markdown可以利用反斜杠插入一些语法中有其他意义的符号
        支持以下符号
        \   反斜线
        `   反引号
        *   星号
        _   底线
        {}  花括号
        []  方括号
        ()  括弧
        #   井字号
        +   加号
        -   减号
        .   英文句点
        !   惊叹号